FYP_Project/Training Set Generation/TrainSet15G15U3_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       4680;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       4730;
    }
    upAndBottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4800;
        startFace       4880;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       9680;
    }
)

// ************************************************************************* //
